# ElementFilter Properties

---
The ElementFilter type exposes the following members.
| Name| Description
---|---|---
| Inverted|  True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
ElementFilter Class
Autodesk.Revit.DB Namespace